<!-- dflook/terraform-github-actions {"workspace":"marmite-prod-hcloud","backend_type":"remote","backend":"ceeee1759565a6c80d0d0fa8438f921c1648396479cb3c4288075e421ed9501b","plan_job_ref":"Job PR Plan #1 at https://github.com/constructions-incongrues/tambouille/actions/runs/7339797834","plan_hash":"92b9af872a12a8cf33584ecceb73c045d38fdaf9793ce2a5b636ba7ea79b4a88","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan in __stacks/marmite__ in the __marmite-prod-hcloud__ workspace
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # hcloud_network.cluster will be created
+   resource "hcloud_network" "cluster" {
+       delete_protection        = false
+       expose_routes_to_vswitch = false
+       id                       = (known after apply)
+       ip_range                 = "10.0.0.0/8"
+       name                     = "cluster"
    }

  # hcloud_network_subnet.nodes will be created
+   resource "hcloud_network_subnet" "nodes" {
+       gateway      = (known after apply)
+       id           = (known after apply)
+       ip_range     = "10.0.1.0/24"
+       network_id   = (known after apply)
+       network_zone = "eu-central"
+       type         = "cloud"
    }

  # hcloud_server.managers[0] will be created
+   resource "hcloud_server" "managers" {
+       allow_deprecated_images    = false
+       backup_window              = (known after apply)
+       backups                    = false
+       datacenter                 = (known after apply)
+       delete_protection          = false
+       firewall_ids               = (known after apply)
+       id                         = (known after apply)
+       ignore_remote_firewall_ids = false
+       image                      = "40093247"
+       ipv4_address               = (known after apply)
+       ipv6_address               = (known after apply)
+       ipv6_network               = (known after apply)
+       keep_disk                  = false
+       labels                     = {
+           "application"  = "marmite"
+           "domain"       = "pastis-hosting.net"
+           "organization" = "constructions-incongrues"
+           "role"         = "manager"
+           "system"       = "tambouille"
        }
+       location                   = "nbg1"
+       name                       = "node-01"
+       rebuild_protection         = false
+       server_type                = "cx11"
+       shutdown_before_deletion   = false
+       ssh_keys                   = [
+           "terraform-cloud",
        ]
+       status                     = (known after apply)

+       network {
+           alias_ips   = (known after apply)
+           ip          = "10.0.1.1"
+           mac_address = (known after apply)
+           network_id  = (known after apply)
        }

+       public_net {
+           ipv4         = (known after apply)
+           ipv4_enabled = false
+           ipv6         = (known after apply)
+           ipv6_enabled = false
        }
    }

  # hcloud_server.managers[1] will be created
+   resource "hcloud_server" "managers" {
+       allow_deprecated_images    = false
+       backup_window              = (known after apply)
+       backups                    = false
+       datacenter                 = (known after apply)
+       delete_protection          = false
+       firewall_ids               = (known after apply)
+       id                         = (known after apply)
+       ignore_remote_firewall_ids = false
+       image                      = "40093247"
+       ipv4_address               = (known after apply)
+       ipv6_address               = (known after apply)
+       ipv6_network               = (known after apply)
+       keep_disk                  = false
+       labels                     = {
+           "application"  = "marmite"
+           "domain"       = "pastis-hosting.net"
+           "organization" = "constructions-incongrues"
+           "role"         = "manager"
+           "system"       = "tambouille"
        }
+       location                   = "nbg1"
+       name                       = "node-02"
+       rebuild_protection         = false
+       server_type                = "cx11"
+       shutdown_before_deletion   = false
+       ssh_keys                   = [
+           "terraform-cloud",
        ]
+       status                     = (known after apply)

+       network {
+           alias_ips   = (known after apply)
+           ip          = "10.0.1.2"
+           mac_address = (known after apply)
+           network_id  = (known after apply)
        }

+       public_net {
+           ipv4         = (known after apply)
+           ipv4_enabled = false
+           ipv6         = (known after apply)
+           ipv6_enabled = false
        }
    }

  # hcloud_server.managers[2] will be created
+   resource "hcloud_server" "managers" {
+       allow_deprecated_images    = false
+       backup_window              = (known after apply)
+       backups                    = false
+       datacenter                 = (known after apply)
+       delete_protection          = false
+       firewall_ids               = (known after apply)
+       id                         = (known after apply)
+       ignore_remote_firewall_ids = false
+       image                      = "40093247"
+       ipv4_address               = (known after apply)
+       ipv6_address               = (known after apply)
+       ipv6_network               = (known after apply)
+       keep_disk                  = false
+       labels                     = {
+           "application"  = "marmite"
+           "domain"       = "pastis-hosting.net"
+           "organization" = "constructions-incongrues"
+           "role"         = "manager"
+           "system"       = "tambouille"
        }
+       location                   = "nbg1"
+       name                       = "node-03"
+       rebuild_protection         = false
+       server_type                = "cx11"
+       shutdown_before_deletion   = false
+       ssh_keys                   = [
+           "terraform-cloud",
        ]
+       status                     = (known after apply)

+       network {
+           alias_ips   = (known after apply)
+           ip          = "10.0.1.3"
+           mac_address = (known after apply)
+           network_id  = (known after apply)
        }

+       public_net {
+           ipv4         = (known after apply)
+           ipv4_enabled = false
+           ipv6         = (known after apply)
+           ipv6_enabled = false
        }
    }

  # hcloud_ssh_key.terraform will be created
+   resource "hcloud_ssh_key" "terraform" {
+       fingerprint = (known after apply)
+       id          = (known after apply)
+       name        = "terraform-cloud"
+       public_key  = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #1](https://github.com/constructions-incongrues/tambouille/actions/runs/7339797834)